<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"0daa322ac0bfce3b8c870a8e247db55135d5fc0b79d0a70928c756a0b5d9a671","plan_job_ref":"Job PR Plan #2 at https://github.com/DGOPS-Kubernetes/terraform-test/actions/runs/11741197455","plan_out_hash":"45a468f6ac3ec79810ecaece595d30772953f466b3e72704f9e8b4cba92736b5","plan_hash":"c8182fd37c9ca9b6533502e5fd14c0a797bf156cddc5e7e260203e77928c388a","plan_text_format":"diff","version":"1.44.0","closed":true} -->
Terraform plan in __.__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.bar will be created
+   resource "local_file" "bar" {
+       content              = "bar!"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./bar.foo"
+       id                   = (known after apply)
    }

  # local_file.foo will be created
+   resource "local_file" "foo" {
+       content              = "foo!"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "./foo.bar"
+       id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   example_output_homedir = false
```
</details>

:white_check_mark: Plan applied in [Push Apply #2](https://github.com/DGOPS-Kubernetes/terraform-test/actions/runs/11741232315)
<details open><summary>Outputs</summary>

```hcl
example_output_homedir = false
```
</details>